; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	image1 - mode
	thermograph3 - mode
	spectrograph4 - mode
	thermograph0 - mode
	infrared2 - mode
	Star2 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared2)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star0)
	(supports instrument6 thermograph0)
	(supports instrument6 spectrograph4)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet15)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star0)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet11)
	(supports instrument9 thermograph3)
	(supports instrument9 infrared2)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 thermograph3)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation1)
	(supports instrument11 infrared2)
	(supports instrument11 thermograph0)
	(supports instrument11 spectrograph4)
	(calibration_target instrument11 GroundStation3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
)
(:goal (and
	(pointing satellite2 Planet4)
	(pointing satellite3 Phenomenon5)
	(have_image Planet4 thermograph0)
	(have_image Star6 thermograph0)
	(have_image Planet7 image1)
	(have_image Planet8 infrared2)
	(have_image Star9 spectrograph4)
	(have_image Planet10 infrared2)
	(have_image Planet11 spectrograph4)
	(have_image Phenomenon12 thermograph3)
	(have_image Planet13 thermograph0)
	(have_image Star14 thermograph3)
	(have_image Planet15 image1)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 13
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 13
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
4. (turn_to satellite4 groundstation1 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 13
5. (calibrate satellite4 instrument10 groundstation1)
   added: (calibrated instrument10)
   goals met: 0 of 13
6. (turn_to satellite4 phenomenon12 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon12)
   goals met: 0 of 13
7. (take_image satellite4 phenomenon12 instrument10 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 1 of 13
8. (turn_to satellite4 planet15 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 planet15)
   goals met: 1 of 13
9. (take_image satellite4 planet15 instrument10 image1)
   added: (have_image planet15 image1)
   goals met: 2 of 13
10. (turn_to satellite4 planet7 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet7)
   goals met: 2 of 13
11. (take_image satellite4 planet7 instrument10 image1)
   added: (have_image planet7 image1)
   goals met: 3 of 13
12. (turn_to satellite4 star14 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star14)
   goals met: 3 of 13
13. (take_image satellite4 star14 instrument10 thermograph3)
   added: (have_image star14 thermograph3)
   goals met: 4 of 13
14. (turn_to satellite3 phenomenon5 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon5)
   goals met: 5 of 13
15. (turn_to satellite2 planet4 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet4)
   goals met: 6 of 13
16. (turn_to satellite1 star0 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star0)
   goals met: 6 of 13
17. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 6 of 13
18. (turn_to satellite1 planet10 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet10)
   goals met: 6 of 13
19. (take_image satellite1 planet10 instrument4 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 7 of 13
20. (turn_to satellite1 planet11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet11)
   goals met: 7 of 13
21. (take_image satellite1 planet11 instrument4 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 8 of 13
22. (turn_to satellite1 planet8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet8)
   goals met: 8 of 13
23. (take_image satellite1 planet8 instrument4 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 9 of 13
24. (turn_to satellite1 star9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star9)
   goals met: 9 of 13
25. (take_image satellite1 star9 instrument4 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 10 of 13
26. (turn_to satellite0 planet13 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet13)
   goals met: 10 of 13
27. (turn_to satellite0 star2 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star2)
   goals met: 10 of 13
28. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 10 of 13
29. (turn_to satellite0 planet13 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet13)
   goals met: 10 of 13
30. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 11 of 13
31. (turn_to satellite0 planet4 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet4)
   goals met: 11 of 13
32. (take_image satellite0 planet4 instrument0 thermograph0)
   added: (have_image planet4 thermograph0)
   goals met: 12 of 13
33. (turn_to satellite0 star6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star6)
   goals met: 12 of 13
34. (take_image satellite0 star6 instrument0 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 13 of 13
